app/controllers/admin/sessions_controller.rb

  def create
    user = User::AsSignIn.find_by(username: params[:username])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'admin' LIMIT 1